import os
os.system("clear")
os.system("CLS")
print ("\033[31m wqlcxm and FileZ present")
print ("✡↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎✞")
print ("░█████╗░██╗░░░██╗██████╗░░██████╗███████╗██████╗░")
print ("██╔══██╗██║░░░██║██╔══██╗██╔════╝██╔════╝██╔══██╗")
print ("██║░░╚═╝██║░░░██║██████╔╝╚█████╗░█████╗░░██║░░██║")
print ("██║░░██╗██║░░░██║██╔══██╗░╚═══██╗██╔══╝░░██║░░██║")
print ("╚█████╔╝╚██████╔╝██║░░██║██████╔╝███████╗██████╔╝")
print ("░╚════╝░░╚═════╝░╚═╝░░╚═╝╚═════╝░╚══════╝╚═════╝░")
print ("☯↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎↔︎✛")
print ("")
print("==============================================")
print ("┌Выберите действие")
print ("\033[35m┃1. Поиск по номеру            2. SMS BOMBER ┃")
print ("┃3. Поддержать проект          4. DDos       ┃")
print ("┃5. О проекте               6. Выйти из тула ┃")
print ("┃Возникли ошибки? Обращайтесь к @doxbinstyle (тг)")
select = input("└Выбрать ")
print("==============================================")
if select == '1':
    os.system("clear")
    os.system("CLS")
    print("\033[35m")
    from get_number import bs4 , BeautifulSoup
    bs4()
    BeautifulSoup()
    from bs4 import BeautifulSoup

elif select == '2':
    from bomber import requests, random, datetime, sys, time, argparse, os , colorama
    random()
    datetime()
    sys()
    time()
    argparse()
    os()
    colorama()
    from colorama import Fore, Back, Style
    from colorama import init
    init()


elif select == '3':
    print("Поддержка проекта:")
    print("Финансовая поддержка нашего проекта может очень сильно повлиять на его функциональность.")
    print("Например, если вы поддержите нас, то мы начнём менят проект в ещё лучшую сторону.")
    print("Пока что, мы работаем над проектом.")
    print("Хочешь поддержать проект?")
    print("Расскажи о нём друзьям или поддержи финансово.")
    print("Сейчас я думаю все хотят получить чью-то информацию в свои руки, так-что твоим друзьям он может понравиться!")
    print("Также нам необходимо расширить бюджет проекта, чтобы сделать поиск по IP и улучшить поичк по номеру.")
    print("Поддержать проект: https://www.donationalerts.com/r/wqlcxm2")
    
    
elif select =='4':
    os.system("CLS")
    print("\033[35m")
    from ddos import requests
    requests()
elif select == '5':
    print("Автора:")
    print('┌Автор: wqlcxm тг: @doxbinstyle')
    print("┃Автор: FileZ тг: FileZ_Plus")
    print("┃Канал wqlcxm - @wqlcxxmstyle")
    print("└Канал FileZ - ???")
    print("")
    print("О проекте:")
    print ("░█████╗░██╗░░░██╗██████╗░░██████╗███████╗██████╗░")
    print ("██╔══██╗██║░░░██║██╔══██╗██╔════╝██╔════╝██╔══██╗")
    print ("██║░░╚═╝██║░░░██║██████╔╝╚█████╗░█████╗░░██║░░██║")
    print ("██║░░██╗██║░░░██║██╔══██╗░╚═══██╗██╔══╝░░██║░░██║")
    print ("╚█████╔╝╚██████╔╝██║░░██║██████╔╝███████╗██████╔╝")
    print ("░╚════╝░░╚═════╝░╚═╝░░╚═╝╚═════╝░╚══════╝╚═════╝░")
    print ("Coder: wqlcxm. 2023")
    print ("Все права защищены.")
    print ("")
    print ("Спасибо:")
    print ("FileZ, за помощь в коде и бета-тестириование.")
    print ("Lilon, за поддержку проекта.")


elif select =='6':
    exit

