print("")
print("\033[31m░█████╗░██╗░░░██╗██████╗░░██████╗███████╗██████╗░")
print("██╔══██╗██║░░░██║██╔══██╗██╔════╝██╔════╝██╔══██╗")
print("██║░░╚═╝██║░░░██║██████╔╝╚█████╗░█████╗░░██║░░██║")
print("██║░░██╗██║░░░██║██╔══██╗░╚═══██╗██╔══╝░░██║░░██║")
print("╚█████╔╝╚██████╔╝██║░░██║██████╔╝███████╗██████╔╝")
print("░╚════╝░░╚═════╝░╚═╝░░╚═╝╚═════╝░╚══════╝╚═════╝░")
print("ВАЖНО К ПРОЧТЕНИЮ")
print("")
print("В связи с статьей 137 УК РФ о нарушении личной жизни вы должны подтвердить свои действия и согласится, что проект не несет ответствености.")
print("В случае деанонимизации проект не несёт отвественности.")
print("Нарушения статьи наказываються штрафом от 200 тысяч рублей.")


print("=========================================================================")
print("Телграмм: https://t.me/curseddoxx")
print("=========================================================================")
print("")
print("===========================================")
print("= Выберите действие:                       =")
print("= 1. Запустить проект.     2. Выйти.       =")
print("= 3. Ответы на вопросы.    4. О проекте.   =")
print("===========================================")

select = input("Выбрать ")
if select == '1':
    from Kills import os
    os()

if select == '2':
    exit

if select == '3':
    print("Что делать если при запуске любой функции тулла он вылетает?")
    print("Запустите файл modules.bat и устаногвите все модули.")
    print("Если не помогло, переустановите Python и поставьте галочку на Add Python To PATH")
    print("")
    print("Когда будет импорт на LINUX и TERMUX?")
    print("Скорее всего не скоро, но мы работаем над этим.")
    print("")
    print("Следите за новостями: https://t.me/curseddoxx")
    print("")

if select == '4':
    print("Данный проект поможет вам найти информацию о человеке.")
    print("Автор - wqlcxm")
    print("Бета-тестер: FileZ")
    print("Поддержали проект: Lilon.")
    print("")
    print("Cursed (перевод - проклятый.)")
    print("Все права защищенны, отвествености проект не несёт.")
    print("Следите за обновлениями: https://t.me/curseddoxx")
    print("GitHub - https://github.com/wqlcxm/Cursed")
    print("Поддержать проект: https://www.donationalerts.com/r/wqlcxm")
    print("Пока всё..")
    print("")